Repository: Chargily/chargily-pay-woocommerce
Catalog: languages/chargilytextdomain-*.po
Languages: ar

source: Activate or deactivate Chargily Pay on your store, input your API keys, and activate test mode to simulate purchases without real money.
ar: قم بتنشيط أو إلغاء تنشيط Chargily Pay في متجرك، أدخل مفاتيح API الخاصة بك، وقم بتنشيط وضع التجربة لمحاكاة الشراء بدون أموال حقيقية.

source: An error occurred while processing your payment. Please try again.
ar: حدث خطأ أثناء معالجة الدفع الخاص بك. يرجى المحاولة مرة أخرى.

source: Arabic
ar: العربية

source: Awaiting Chargily payment
ar: في انتظار الدفع من Chargily

source: Change status to expired
ar: تغيير الحالة إلى منتهية الصلاحية

source: Chargily
ar: شارجيلي

source: Chargily Pay
ar: شارجيلي باي

source: Chargily Pay™ (EDAHABIA/CIB)
ar: شارجيلي باي (EDAHABIA/CIB)

source: Chargily Pay™ Settings
ar: إعدادات Chargily Pay™

source: Chargily Pay™: Test Mode is enabled.
ar: Chargily Pay™: وضع الاختبار مفعل.

source: Check API keys
ar: تحقق من مفاتيح API

source: Check connection
ar: تحقق من الاتصال

source: Check your API keys.
ar: تحقق من مفاتيح API الخاصة بك.

source: CIB Card
ar: البطاقة البنكية CIB

source: Collect Shipping Address
ar: طلب عنوان الشحن

source: Collect shipping address on checkout page.
ar: طلب عنوان الشحن على صفحة الدفع.

source: completed
ar: مكتمل

source: Confirmation status
ar: حالة التأكيد

source: Create Products
ar: إنشاء المنتجات

source: Description
ar: الوصف

source: EDAHABIA
ar: الذهبية

source: Enable Chargily Pay
ar: تفعيل دفع Chargily

source: Enable product creation on Chargily Pay.
ar: تفعيل إنشاء المنتج على دفع Chargily.

source: Enable Test Mode
ar: تفعيل وضع الاختبار

source: Enable this option if your server support .htaccess file rewriting
ar: قم بتمكين هذا الخيار إذا كان خادمك يدعم إعادة كتابة ملف htaccess

source: Enable/Disable
ar: تفعيل/تعطيل

source: English
ar: الإنجليزية

source: Enter your API keys.
ar: أدخل مفاتيح API الخاصة بك.

source: Enter your Chargily Live API key.
ar: أدخل مفتاح API الحي لـ Chargily.

source: Enter your Chargily Live API secret.
ar: أدخل سر API الحي لـ Chargily.

source: Enter your Chargily Test API key.
ar: أدخل مفتاح API الخاص بالاختبار لـ Chargily.

source: Enter your Chargily Test API secret.
ar: أدخل سر API الخاص بالاختبار لـ Chargily.

source: Enter your Live API keys.
ar: أدخل مفاتيح API Live الخاصة بك.

source: Enter your Test API keys.
ar: أدخل مفاتيح API Test الخاصة بك للتجربة.

source: Failed to create customer in Chargily.
ar: فشل في إنشاء العميل في Chargily.

source: Failed to create price in Chargily.
ar: فشل في إنشاء السعر في Chargily.

source: Failed to create product in Chargily.
ar: فشل في إنشاء المنتج في Chargily.

source: Find out where to find your API keys
ar: اكتشف أين يمكنك العثور على مفاتيح API الخاصة بك

source: Fix styling compatibility.
ar: إصلاح توافق التصميم.

source: Force Chargily Pay plugin styling
ar: فرض تصميم بلاجن شارجيلي باي

source: French
ar: الفرنسية

source: General
ar: عام

source: Get support
ar: احصل على الدعم

source: https://chargily.com
ar: https://chargily.com/business/pay

source: If enabled, Chargily Pay fees will be paid by your customers.
ar: إذا تم تفعيله، سيتم دفع رسوم Chargily Pay بواسطة عملائك.

source: If enabled, products will be created on Chargily Pay upon checkout.
ar: إذا تم التفعيل، سيتم إنشاء المنتجات على دفع Chargily عند الدفع.

source: If enabled, shipping address fields will appear and should be filled on checkout page.
ar: إذا كان مفعل، ستظهر حقول عنوان الشحن ويجب ملؤها في صفحة الدفع.

source: If enabled, Webhook will use the .htaccess rewrite rule method. Please re-save the Permalink settings again <a href="%s" target="_blank">Permalink</a>.
ar: في حالة التمكين، سيستخدم Webhook طريقة قاعدة إعادة الكتابة ‎.htaccess الرجاء إعادة حفظ إعدادات الرابط الثابت مرة أخرى <a href="%s" target="_blank">Permalink</a>.

source: If enabled, you will use Chargily Pay in Test Mode.
ar: إذا تم التفعيل، ستستخدم دفع Chargily في وضع الاختبار.

source: If the style of the Chargily Pay plugin is compromised due to a styling modification by another plugin, activating this option will rectify the issue.
ar: إذا تضرر تصميم بلاجن شارجيلي باي بسبب بلاجن آخر، سيؤدي تفعيل هذا الخيار إلى تصحيح المشكلة.

source: Just one more step to complete the setup of Chargily Pay™ and begin accepting payments.
ar: خطوة واحدة فقط متبقية لإكمال إعداد Chargily Pay™ وبدء قبول الدفعات.

source: Live Public key
ar: المفتاح العام للLive Mode

source: Live Secret key
ar: المفتاح السري للLive Mode

source: on hold
ar: في الانتظار

source: On the thanks page
ar: على صفحة الشكر

source: opens in a new tab
ar: يفتح في تبويب جديد

# Order status
source: Expired
ar: منتهي الصلاحية

source: Pass Fees To Customer
ar: مرر الرسوم للعميل

source: Place the message you want to appear on the thank you page after completing the purchase of the product.
ar: ضع الرسالة التي تريد ظهورها على صفحة الشكر بعد إتمام شراء المنتج.

source: processing
ar: قيد المعالجة

source: Test mode
ar: وضع الاختبار

source: Test Public key
ar: المفتاح العام للTest Mode

source: Test Secret key
ar: المفتاح السري للTest Mode

source: Thank you for your order, please click the button below to pay with Chargily.
ar: شكراً لطلبك، يرجى النقر على الزر أدناه للدفع باستخدام Chargily.

source: thank you, the product will come soon.
ar: شكرا لك، سيصل المنتج قريبا.

source: The easiest and free way to integrate e-payment API through EDAHABIA of Algerie Poste and CIB of SATIM into your Wordpress/WooCommerce platform.
ar: الطريقة الأسهل والمجانية لدمج الدفع الإلكتروني عن طريق الذهبية الخاصة ببريد الجزائر وCIB الخاصة بالبنوك الجزائرية في منصة الووردبراسووكومرس الخاصة بك.

source: The language that will appear on chargily payment page
ar: لغة صفحة الدفع على شارجيلي باي

source: This controls the description which the user sees during checkout.
ar: هذا يتحكم في الوصف الذي يراه المستخدم أثناء الدفع.

source: This controls the title which the user sees during checkout.
ar: هذا يتحكم في العنوان الذي يراه المستخدم أثناء الدفع.

source: This status will be set when the payment succeeds.
ar: سيتم تعيين هذه الحالة عند نجاح الدفع.

source: Title
ar: العنوان

source: Understand Test and Live modes
ar: فهم أوضاع Test وLive

source: Webhook Type
ar: نوع الخطاف (Webhook)

source: You are in Live Mode but your Live API keys are missing.
ar: أنت في Live Mode ولكن مفاتيح API Live الخاصة بك مفقودة.

source: You are in Test Mode but your Test API keys are missing.
ar: أنت في Test Mode ولكن مفاتيح API Test الاختبار الخاصة بك مفقودة.

source: 🔒 Secure e-payment gateway.
ar: 🔒 بوابة الدفع الإلكتروني الآمنة.

source: 🔒 Secure E-Payment provided by
ar: 🔒 بوابة الدفع الإلكتروني الآمنة.
